#+TITLE: C FUNDAMENTALS PRACTICE - VARIABLES
#+AUTHOR: [yourName] (pledged)
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :comments both
* TODO Fix the program

  1) The program [[pgm:assign_err]] declares and initializes the variable
     ~i~ with the value ~0~. After assigning ~1~ to ~i~, it should print out ~1~
     but it prints ~0~ instead.
     
  2) Fix the error and then run the block with ~C-c C-c~ to check.

  #+name: pgm:assign_err
  #+begin_src C
    int i = 0;
    i == 1;
    printf("%d\n", i);
  #+end_src

  #+RESULTS: assign
  : 0

